package com.business.common;

/**
 * @description: 聚爱商旅共用枚举类
 * @projectName: CentralKitchenSecondPhase
 * @packageName: com.business.common
 * @author: llf
 * @createTime: 2021/3/19 18:09
 * @version: 1.0
 */
public enum BusinessTravelEnums {

    ///////////////////////////---- 公用相关枚举 ----///////////////////////////
    E_100101(100101, "传入参数与接口不匹配"),
    E_100102(100102,"验证码错误"),
    E_100103(100103,"验证码为空"),
    E_100104(100104,"查询结果为空"),
    E_100105(100105,"ID格式不正确"),
    E_100106(100106,"上传错误"),
    E_100107(100107,"发送验证码错误"),
    E_100108(100108,"传入对象为空"),
    E_100109(100109,"手机号格式不正确"),
    E_100110(100110,"用户名为空"),
    E_100111(100111,"密码为空"),
    E_100112(100112,"手机号为空"),
    E_100113(100113,"手机号已存在"),
    E_100114(100114,"用户名已存在"),
    E_100115(100115,"密码不正确"),
    E_100116(100116,"删除成功"),
    E_100117(100117,"删除失败，请重试"),
    E_100118(100118,"修改成功"),
    E_100119(100119,"修改失败，请重试"),
    E_100120(100120,"批量操作失败，请重试"),
    E_100121(100121,"OK"),

    ///////////////////////////---- 业务功能相关枚举 ----///////////////////////////

                        /////--- 中央厨房 ---/////
    E_200101(200101, "餐卡余额不足，请充值"),
    E_200102(200102,"订单号不存在，请检查核对"),
    E_200103(200103,"厨房已过营业时间，店家正在休息"),
    E_200104(200104,"该菜品库存不足"),
    E_200105(200105,"此菜品不存在"),
    E_200106(200106,"餐卡充值失败，请重试"),
    E_200107(200107,"点餐成功"),

                        /////--- 聚爱商旅 ---/////
    E_200201(200201, "申请单已提交，请耐心等待审核"),
    E_200202(200202,"未查到该员工相关信息"),
    E_200203(200203,"结算失败，请重试"),
    E_200204(200204,"未查到该订单相关信息，请核对"),
    E_200205(200205,"此申请单不存在"),
    E_200206(200206,"申请单提交失败，请重试"),







    ///////////////////////////---- 其他错误 ----///////////////////////////
    UNKNOWN(999999,"未知错误");

    /**
     * @Description: code值 或者 status状态值
     * @Author: llf
     * @Date: 2021/3/19 18:10
     **/
    private int code;

    /**
     * @Description: code名称
     * @Author: llf
     * @Date: 2021/3/19 18:10
     **/
    private String msg;

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public String getMsg() {
        return msg;
    }

    public void setMsg(String msg) {
        this.msg = msg;
    }

    BusinessTravelEnums(int code, String msg) {
        this.code = code;
        this.msg = msg;
    }

}
